Repository: kougianos/phoneVice
Catalog: locale/*/LC_MESSAGES/phonevice.po
Languages: el_gr

source: PhoneVice description
el_gr: Περιγραφή

source: PhoneVice Heading
el_gr: Κεφαλίδα PhoneVice

source: Budget
el_gr: Μπάτζετ

source: Features
el_gr: Χαρακτηριστικά

source: Usage
el_gr: Χρήση

source: Results
el_gr: Αποτελέσματα

source: Let us know how much you're going to spend
el_gr: Πόσα χρήματα διαθέτετε;

source: Home Page
el_gr: Αρχική σελίδα

source: Next step
el_gr: Επόμενο βήμα

source: Extra Features
el_gr: Επιπλέον χαρακτηριστικά

source: Select as many options as you like.
el_gr: Επιλέξτε όσα θέλετε.

source: Previous step
el_gr: Προηγούμενο βήμα

source: Next Step
el_gr: Επόμενο βήμα

source: This is your next smartphone. 3 clicks away.
el_gr: Αυτό είναι το επομένο smartphone σου. 3 κλικ μακριά.

source: START NOW!
el_gr: ΕΝΑΡΞΗ!

source: Smartphone database
el_gr: Βάση δεδομένων

source: Personal Recommendation
el_gr: Προσωποποιημένες προτάσεις

source: Save time
el_gr: Σώστε χρόνο

source: Logout
el_gr: Αποσύνδεση

source: Log in/Sign up
el_gr: Σύνδεση

source: Summary
el_gr: Περίληψη

source: Best battery out of 3
el_gr: Καλύτερη μπαταρία εκ των 3

source: Best PPI out of 3
el_gr: Καλύτερο PPI εκ των 3

source: Worst battery out of 3
el_gr: Χειρότερη μπαταρία εκ των 3

source: Worst PPI out of 3
el_gr: Χειρότερο PPI εκ των 3

source: Display
el_gr: Οθόνη

source: Processor
el_gr: Επεξεργαστής

source: Battery
el_gr: Μπαταρία

source: Rear Camera
el_gr: Κυρίως κάμερα

source: Front Camera
el_gr: Μπροστά κάμερα

source: Storage
el_gr: Χωρητικότητα

source: OS
el_gr: Λειτουργικό

source: Complete Specs
el_gr: Πλήρη χαρακτηριστικά

source: Cheapest Price
el_gr: Φθηνότερη τιμή

source: Details
el_gr: Λεπτομέρειες

source: Compare
el_gr: Σύγκριση

source: How will you be using your phone?
el_gr: Πως θα χρησιμοποιείτε το κινητό σας;

source: Basic Use
el_gr: Βασική χρήση

source: Everyday use. A little bit of everything. Social media, gaming, photos, video streaming etc. are things you will be doing on a daily basis with your phone, but none of them is really important for you.
el_gr: Καθημερινή χρήση. Λίγο απ' όλα. Social media, gaming, φωτογραφίες, video streaming κλπ είναι πράγματα που θα κάνετε σε καθημερινή βάση με το κινητό σας, αλλά κανένα από αυτά δεν είναι τόσο σημαντικό.

source: Finds phones with an all around good performance.
el_gr: Βρίσκει κινητά με καλές επιδόσεις γενικά.

source: Custom Use
el_gr: Ειδική χρήση

source: Are you a hardcore gamer? Do you like watching videos all day on your smartphone? Or are you a social media person who can't live without their favorite social apps?
el_gr: Είστε hardcore gamer; Σας αρέσει να βλέπετε βίντεο όλη μέρα στο κινητό σας; Η μήπως είστε από τους τύπους που σερφάρουν όλη μέρα στις αγαπημένες τους social media εφαρμογές;

source: Finds phones based on types of use.
el_gr: Βρίσκει κινητά ανάλογα με τους τύπους χρήσης.

source: Custom
el_gr: Ειδική

source: Unimportant
el_gr: Αδιάφορο

source: Somewhat
el_gr: Κάπως

source: Relatively
el_gr: Σχετικά

source: Very
el_gr: Πολύ

source: Top
el_gr: Υπερβολικά

source: Importance slider
el_gr: Δείκτης βαρύτητας

source: Results!
el_gr: Αποτελέσματα!

source: Our database contains thousands of models to make sure we find the one that suits you best!
el_gr: Η βάση μας έχει χιλιάδες μοντέλα έτσι ώστε εσείς να βρείτε αυτό που σας ταιριάζει καλύτερα!

source: Our algorithm is designed to provide unique recommendations that depend on and fulfill your own needs.
el_gr: Ο αλγόριθμος μας είναι σχεδιασμένος ώστε να παρέχει μοναδικές προτάσεις που εξαρτώνται και καλύπτουν τις δικές σας ανάγκες.

source: Most people need days to find their favorite phone
el_gr: Οι περισσότεροι άνθρωποι χρειάζονται μέρες για να βρουν το αγαπημένο τους τηλέφωνο

source: We can help you find in a few minutes. It's 3 clicks away!
el_gr: Εμείς μπορούμε να σας βοηθήσουμε να το βρείτε σε λίγα λεπτά. Είναι 3 κλικ μακριά!

source: Basic
el_gr: Βασική
